# IFCExternalServiceUIData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCExternalServiceUIData Properties
IFCExternalServiceUIData Class See Also
---
The IFCExternalServiceUIData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Document | return the document |
| IsReset | flag to indicate the value has been reset |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ParamId | the parameter id |
| SelectedIFCItem | The selected IFC Item (can be IFC Entity, or PredefinedType) |

# See Also
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace